/* 
ايصال رسالة للمستخدم بطريقتين: 
1- console.log(`الرسالة`) --> رسالة تظهر بالكونسل
2- alert(`الرسالة`) --> رسالة تظهر بالشاشة ولا يستطيع المستخدم إستخدام الصفحة الا بضغط ok

المتغيرات:
let اسم المتغير = value;
Example : let name = "athbi";

أسم المتغير يجب لايحتوي على مسافات او رموز، او يبدأ بأرقام

مستقبل المتغيرات (prompt)

let name = prompt("enter your username");

*/


/* مثال موقع شراء القهوة حسب عدد الأكواب */

let oneCupPrice = 1.5; // سعر الكوب الواحد
let myMoney = prompt("كم فلوسك ؟"); // المبلغ الذي يمتلكه المستخدم
let myCups = prompt("كم كوب تريد ؟"); // عدد الأكواب التي يريديها

let neededMoney = myCups * oneCupPrice // عملية يتم حساب فيها السعر النهائي

if ( myMoney >= neededMoney) {
    // تستطيع شراء القهوة
    console.log("بالعافيه")
} else {
    //لاتستطيع شراء القهوة
    console.log("فلوسك لاتكفي")
}